{
  "authors": [
    {
      "id": 1,
      "name": "Bessel Van Der Kolk"
    },
    {
      "name": "Tadas Blinda",
      "id": 2
    },
    {
      "name": "Tomas Karolis",
      "id": 3
    },
    {
      "name": "William Gibson",
      "id": 4
    },
    {
      "name": "Julie Bogart",
      "id": 5
    }
  ],
  "books": [
    {
      "id": 1,
      "title": "KŪNAS MENA VISKĄ: kaip išgydyti kūno, proto ir sielos traumas",
      "description": "Vienas žymiausių pasaulyje traumų specialistų dr. Besselis van der Kolkas daugiau kaip tris dešimtmečius dirbo su traumas patyrusiais žmonėmis. Knygoje „Kūnas mena viską: kaip išgydyti kūno, proto ir sielos traumas“ jis pasitelkia naujausius mokslinius pasiekimus ir parodo skaitytojams, kaip trauma tikrąja žodžio prasme pakeičia ir kūną, ir smegenis, pablogina traumuotų žmonių gebėjimą justi malonumą, domėtis įvairia veikla, kontroliuoti save ir pasitikėti. Autorius tyrinėja naujoviškus gydymo būdus – nuo nervinio grįžtamojo ryšio ir meditacijos iki sporto, dramos ir jogos, kurie atveria naujas pasveikimo galimybes, suaktyvindami natūralų smegenų neuroplastiškumą. Knyga „Kūnas mena viską: kaip išgydyti kūno, proto ir sielos traumas“, pagrįsta dr. B. van der Kolko ir kitų įžymių specialistų atliktais tyrimais, parodo didžiulę mūsų santykių, kurie ir žaloja, ir gydo, jėgą bei suteikia naują viltį atgimti kitokiam gyvenimui.",
      "year": 2020,
      "publisher": "Liūtai ne avys",
      "pages": 640,
      "authorId": 1,
      "categoryId": 2,
      "photo": {
        "title": "Knygos viršelis",
        "url": "https://www.patogupirkti.lt/media/catalog/product/cache/1/image/1800x/040ec09b1e35df139433887a97daa66f/k/u/kunas-mena-viska-kaip-isgydyti-kuno-proto.jpg"
      }
    },
    {
      "title": "Kaip užauginti kritiškai mąstančius vaikus",
      "description": "Knygoje „Kaip užauginti kritiškai mąstančius vaikus“ garsi amerikiečių edukatorė Julie Bogart remiasi daugiau nei 20 metų trunkančia vaikų ugdymo namuose ir mokymų programų rengimo patirtimi. Autorė siūlo praktinius būdus, kaip skatinti vaiko gebėjimą tyrinėti pasaulį kiekviename jo raidos etape, atskleidžia, kaip vaiko potraukiai ir išankstiniai nusistatymai veikia jo įsitikinimus, kokią įtaką patirtis mokykloje ir naršymas internete daro mąstymui, kas skatina kurti naujas įžvalgas, o ne tiesiog „suvartoti\" tai, ko buvo išmokytas, pateikia strategijų, kaip susigrąžinti sąmoningo skaitymo įgūdžius.",
      "publisher": "Vaga",
      "year": 2023,
      "pages": 368,
      "authorId": 5,
      "categoryId": 2,
      "photo": {
        "title": "Book cover",
        "url": "https://thumb.knygos-static.lt/ujZT0ZGBCyP4AoG3HazBtF4J5l0=/fit-in/0x800/filters:cwatermark(static/wm.png,500,75,30)/images/books/13828869/1683784530_kaip-uzauginti-kritiskai-mastancius-vaikus_virselio-priekis.png"
      },
      "id": 4
    },
    {
      "title": "Neuromantas",
      "description": "„Neuromantas\" – vienintelė knyga, laimėjusi visus tris – Hugo, „Nebulos\" ir Philipo K. Dicko – apdovanojimus. Tai mokslinės fantastikos šedevras, viena įtaigiausių XX amžiuje sukurtų ateities vizijų.\n\nKeisas buvo mitriausias duomenų vagis matricoje, bet kartą supykdė žmones, kurių nederėjo erzinti. Norėdami pamokyti, jie pažeidė Keisui nervų sistemą ir užkirto kelią patekti į kibererdvę. Dabar paslaptingas naujas darbdavys suteikia jam paskutinę progą: nusamdo surengti antpuolį, kurio tikslas – įveikti neįsivaizduojamai galingą dirbtinį intelektą. Padedamas Molės, gatvės samurajės veidrodinėmis akimis, ir savo mirusio mokytojo Diksio, kurio sąmonė įrašyta į kasetę, Keisas leidžiasi į nuotykį.\n\n„Neuromantas\" – pirmas visa apimantis žvilgsnis į suskaitmenintą žmonijos ateitį. Knyga meta iššūkį tam, kaip suvokiame technologijas ir save pačius, keičia vaizduotės kraštovaizdį.",
      "publisher": "Kitos knygos",
      "year": 2023,
      "pages": 318,
      "authorId": 4,
      "categoryId": 2,
      "photo": {
        "title": "Green book cover",
        "url": "https://thumb.knygos-static.lt/YL0Efy1LFs3-NuoW7RK3CbRaNw8=/fit-in/0x800/filters:cwatermark(static/wm.png,500,75,30)/images/books/6050091/1685450948_9786094275500_Neuromantas.jpeg"
      },
      "id": 6
    }
  ],
  "categories": [
    {
      "id": 1,
      "title": "Grožinė literatūra"
    },
    {
      "id": 2,
      "title": "Populiarioji psichologija"
    },
    {
      "id": 3,
      "title": "Literatūra vaikams ir jaunimui"
    },
    {
      "id": 4,
      "title": "Autobiografija"
    },
    {
      "title": "Drama",
      "id": 5
    },
    {
      "title": "Treileris",
      "id": 6
    }
  ],
  "comments": [
    {
      "id": 1,
      "title": "Gera knyga!",
      "user": "Tomas",
      "date": "2023-01-07",
      "bookId": 1
    },
    {
      "id": 2,
      "title": "Gera knyga!",
      "user": "Tomas",
      "date": "2023-01-07",
      "bookId": 1
    },
    {
      "title": "Nebloga",
      "user": "Giedre M.",
      "date": "2023-05-23",
      "bookId": 4,
      "id": 5
    },
    {
      "title": "Kazkas naujo",
      "user": "Kevinas",
      "date": "2023-06-20",
      "bookId": 1,
      "id": 6
    },
    {
      "title": "Patiko",
      "user": "Domas_D",
      "date": "2023-05-29",
      "bookId": 4,
      "id": 8
    },
    {
      "title": "Nice",
      "user": "Karolina",
      "date": "2023-06-28",
      "bookId": 4,
      "id": 9
    },
    {
      "title": "Nustebino",
      "user": "Gabriele K.",
      "date": "2023-06-15",
      "bookId": 1,
      "id": 10
    }
  ]
}